simpleFoam/campagneMeshRefinement/D050L474W090Z002H150V020_C_woMount_orig/system/pimpleTemplate/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    //nOuterCorrectors    100;

    /*
    residualControl
    {
        U
        {
            tolerance 1e-4;//1e-5;
            relTol  0;
        }
        p
        {
            tolerance 1e-4;//5e-4;
            relTol 0;
        }
    }
    */
}

/*
relaxationFactors
{
    fields
    {
        p   0.3;
        pFinal 1;
    }
    equations
    {
        "U|k|epsilon|omega"               0.3; // 0.9 is more stable but 0.95 more convergent
        "(U|k|epsilon|omega)Final"            1; // 0.9 is more stable but 0.95 more convergent
    }
}
*/

// ************************************************************************* //

